{
    "posts": [{
            "title": "David Zaslav has 10 year plan for future of DC",
            "body": "Warner Bros. reportedly has a ten-year plan for their DC films, similar to what the MCU has over at Disney. Following the shocking news that Warner Bros. Discovery is scrapping Batgirl completely even though the film had been nearly completed, the studio and the future of the DCEU brand has been at the center of numerous questions and headlines. Batgirl's cancellation was an unprecedented move, and it signaled a major shift in strategy for Warner Bros. Discovery. and its DC brand.\n\nRumors have begun to circulate that the planned Supergirl film starring Sasha Calle that would spin out from The Flash has been scrapped, and there is a chance the studio will also push back release dates for major films like Shazam! Fury of the Gods and Aquaman and the Lost Kingdom. Warner Bros. Discovery has tried to deflect the negative attention by announcing a release date for Joker: Folie à Deux; additionally, Lady Gaga confirmed she has joined as Harley Quinn. However, with Batgirl's cancellation looming large, it seems like every small DC project from Zatanna to Static Shock is in danger of being scrapped if it does not meet the new regime's vision for what DC movies should look or feel like.\n\nDuring the Warner Bros. Discovery Quarterly 2 Investor Call (via Variety), CEO David Zaslav says that DC is a top priority for the studio and states his plan to form a team with a \"10-year plan focusing just on DC.\" This is not unlike the approach Disney has taken with the MCU, which was crafted by Kevin Feige, Bob Iger, and Alan Horn. Warner Bros. wants to focus on quality and will not release DC movies before they are ready. Despite saying they have a ten-year plan, however, Zaslav does not mention who would be leading this team.\n\nWarner Bros. Discovery has recruited Horn back to the company in a consulting position after he retired from Disney in 2021. Horn was previously COO of Warner Bros. from 1999 to 2011, and under his leadership, the studio had many hits including the Harry Potter franchise and Christopher Nolan's Dark Knight trilogy. With Horn returning to Warner Bros., Zaslav is likely hoping that he will be able to shape DC back to the box office success it was during the Dark Knight days while bringing in everything he learned at Disney with the MCU. Horn might very well be a part of this mysterious DC team, though that is mere speculation at this point. At the very least, it can be said that setting up a proper roadmap for the future should be a positive change for DC.\n\nAside from the recently announced Joker: Folie à Deux, there are only five other DC films with set release dates: Black Adam, Shazam! Fury of the Gods, Aquaman and the Lost Kingdom, The Flash, and Blue Beetle. However, the cancellation of Batgirl shows that no film is truly safe if the new studio does not think it is worthy of release, or if it does not fit within this 10-year plan. No DCEU films after 2024 have been set for release. It was previously reported that DC wanted its own Feige, so it is possible an announcement could be coming soon about a new form of leadership and what the plan is moving forward.",
            "likes": 7,
            "id": 1
        },
        {
            "title": "Phase 6 ends with two Avengers movie",
            "body": " At the Comic-Con in San Diego, Marvel Studios' chief Kevin Feige announced that two new 'Avengers' films will end Phase 6. The films include 'Avengers: The Kang Dynasty', which will be in theatres on May 2, 2025, and 'Avengers: Secret Wars' hitting the screens on November 7, 2025.\n\nThe announcement makes clear that the multiversal shenanigans of 'Loki', 'Spider-Man: No Way Home' and 'Doctor Strange in the Multiverse of Madness' are leading the Marvel Cinematic Universe to a cataclysmic crossover event to end all crossover events -- quite literally, it could reshape the fundamental fabric of the MCU from the ground up, reports 'Variety'.\n\nIt all revolves around a Marvel comics crossover miniseries from 2015 called Secret Wars, which evokes an earlier crossover miniseries from the mid-1980s also called Secret Wars. In the earlier iteration, every Marvel character imaginable is pitted against each other when a character called the Beyonder transports them all to a planet subtly called Battleworld.\n\nIt was a more-or-less baldfaced ploy to juice toy sales and is not particularly well regarded among fans.\n\nAccording to 'Variety', the 2015 version took many of the same ideas but deployed them into a far more narratively complex storyline.\n\nThis time, the catalyst is the incursion between the main Marvel universe (Earth-616) and the Ultimate Marvel universe (Earth-1610) that causes the destruction of both.\n\nIn its wake, iterations of many Marvel characters find themselves living in a new, post-apocalyptic universe called Battleworld that is policed by every version of Thor in the multiverse called the Thor Corps and captained by Sheriff Strange.\n\nGetting to this storyline, however, requires at least a few critical characters to make their MCU debut, especially the 'Fantastic Four' and their main nemesis, Victor Von Doom, as well as a character known as Molecule Man.\n\n",
            "likes": 3,
            "id": 2
        },
        {
            "title": "Marvels I am GROOT Premeires today",
            "body": "The I Am Groot release date is set at 3 a.m. ET/12 a.m. PT on Wednesday, Aug. 10. The series directed by executive producer Kirsten Lepore will feature five shorts that will all debut at once. The story takes place after the events of James Gunn’s Guardians of the Galaxy Vol. 2 and one of the film’s mid-credits scenes. I Am Groot is “a series of original shorts exploring Baby Groot’s glory days growing up, and getting into trouble, among the stars.”",
            "likes": 12,
            "id": 3
        },
        {
            "title": "Lock and Key season 3 will include time travel element",
            "body": "\nYou’ll be able to unlock the magic one last time when “Locke & Key” returns to Netflix for the third and final season on August 10, and you can check out the Season 3 trailer below.\n\nThe series follows the Locke siblings and their mother who move into their ancestral home, which they discover is full of magical keys that may be connected to their father’s death.\n\nIn Season 3, “The Locke family uncovers more magic within Keyhouse, while a new threat — the most dangerous one yet — looms in Matheson with plans of his own for the keys. ”\n\nDarby Stanchfield (“Scandal”) stars as Nina Locke, Jackson Robert Scott (IT) as Bode Locke, Connor Jessup (“American Crime”) as Tyler Locke, Emilia Jones (“Horrible Histories”) as Kinsey Locke,  Bill Heck (The Ballad of Buster Scruggs) as Rendell Locke, Laysla De Oliveira as Dodge, Thomas Mitchell Barnet as Sam Lesser, and Griffin Gluck (“American Vandal”) as Gabe.\n\n“Locke & Key” is based on the comic book series by Joe Hill and Gabriel Rodríguez.",
            "likes": 8,
            "id": 4
        }
    ],
    "polls": [{
        "id": 1,
        "question": "What do you prefer",
        "answerA": "Vue",
        "answerB": "React"
    }]
}